agenticaiuw/hivemind/firmware/nrf9160/src/main.c
K_SEM_DEFINE(memo_press_sem, 0, 1);
K_SEM_DEFINE(approve_press_sem, 0, 1);

/*
 * Owner-decision control frames, produced on main/ISR and consumed by the
 * WS I/O thread — the one place allowed to touch the socket, so a stalled
 * modem send can never block a button ISR or the codec loop. Contract per
 * the wire spec: sent only while the converse socket is OPEN; a closed
 * socket drops them (a menu twist from a dead zone is stale the moment
 * the link returns, and a late approval decision is worse than none).
 */
static atomic_t approval_decision_req; /* 0 none, 1 approve, 2 deny */
static atomic_t menu_step_backlog;     /* signed detents not yet sent */
static atomic_t menu_select_req;
/* Cap unsent detents: past this the owner is spinning against a dead
 * link and older steps carry no information a fresher one lacks. */
#define MENU_STEP_BACKLOG_MAX 8
#define APPROVE_LONG_PRESS_MS 1500
#define APPROVE_MIN_PRESS_MS 30
#define ENCODER_PUSH_DEBOUNCE_MS 150

/*
 * ---- Wired speaker (MAX98357A) sink selection ----
 *
 * The amp taps the SAME I2S TX wires the ESP32 listens on (BCLK P0.18,
 * LRCLK P0.17, DIN P0.19) — there is no second audio path in firmware,
 * only the SD_MODE gate on P0.01.  Driven high the amp reproduces the
 * left I2S slot (the only slot this firmware writes audio into; MAX98357A
 * datasheet Table 5: V_SD_MODE > 1.4 V selects the left word), driven low
 * it is in 0.6 uA shutdown.  The ESP32 cannot be gated from here, so the
 * three sink states map to one pin:
 *
 *   bluetooth  SD_MODE low   (boot default — the proven path)
 *   speaker    SD_MODE high  (ESP32 keeps hearing the wire; whether it
 *   both       SD_MODE high   also PLAYS is the relay/ESP32's business)
 *
 * Selected over the converse socket by {"type":"audio_sink","sink":...},
 * parsed on the WS I/O thread next to the other control frames.  The
 * format on the wire needs no change for the amp: 24-bit words in 32-BCLK
 * slots at 31250 frames/s — the MAX98357A DAI accepts 16/24/32-bit I2S at
 * 8-96 kHz sample rates ("Digital Audio Interface Modes", datasheet
 * p.16); 31250 Hz sits in the 30-50 kHz digital-filter bin (Table 4) and
 * is within the frequency detector's 32 kHz class (-2.4 %, far inside
 * the part's tolerance for LRCLK tracking).
 */
enum audio_sink_sel {
	AUDIO_SINK_BLUETOOTH = 0,
	AUDIO_SINK_SPEAKER,
	AUDIO_SINK_BOTH,
};
#define AUDIO_SINK_BOOT_DEFAULT AUDIO_SINK_BLUETOOTH
static const struct gpio_dt_spec amp_sd_mode =
	GPIO_DT_SPEC_GET(AMP_SD_MODE_NODE, gpios);
static bool amp_sd_mode_ready;
static uint8_t audio_sink_current = AUDIO_SINK_BOOT_DEFAULT;

/*
 * ---- Volume knob (pot wiper on SAADC AIN2/P0.15) ----
 *
 * Moved from the ESP32 (GPIO34) by architecture ruling: the ESP32 is a
 * stand-in for a dumb Bluetooth module, so the knob and its gain must
 * live on the nRF9160 and the wire must carry pre-scaled PCM.  Constants
 * are the ESP32 tuning carried over 1:1 (same 12-bit scale): ~20 Hz
 * poll, 2 % hysteresis over the wiper noise, end-stop snap so true 0 and
 * true unity are reachable, perceptual (squared) curve because loudness
 * tracks power.  The knob is an ATTENUATOR, never an amplifier: unity is
 * the ceiling, which is why the Q12 multiply in tx_apply_volume needs no
 * saturation — nothing can exceed the already-clamped input sample.
 */
#define VOLUME_POLL_INTERVAL_MS 50
#define VOLUME_HYSTERESIS_COUNTS 82
#define VOLUME_SNAP_LOW 40
#define VOLUME_SNAP_HIGH 4055
#define VOLUME_RAW_MAX 4095
#define VOLUME_GAIN_UNITY_Q12 4096
/* Written by volume_poll (main thread), read per-sample by the audio
 * thread: a plain aligned word, atomic on this core by construction. */
static atomic_t volume_gain_q12 = ATOMIC_INIT(VOLUME_GAIN_UNITY_Q12);
/* Pending {"type":"volume"} report for the WS I/O thread: -1 = nothing,
 * else (hundredths << 16) | raw.  Same drop-when-closed contract as the
 * other owner controls. */
static atomic_t volume_report = ATOMIC_INIT(-1);
static bool volume_adc_ready;
static int volume_last_raw = -1;
static int64_t volume_next_poll_ms;

/*
 * Mic RX slab is dedicated. audio_workspace is the live PCM TX ring during
 * capture and the Opus decode workspace for reply playback.
 */
static struct k_mem_slab mic_rx_slab;
static uint8_t mic_rx_storage[MIC_RX_BLOCK_SIZE * MIC_RX_BLOCK_COUNT]
	__aligned(4);
static uint8_t audio_workspace[PENDANT_AUDIO_WORKSPACE_BYTES] __aligned(4);
BUILD_ASSERT(sizeof(mic_rx_storage) ==
		     MIC_RX_BLOCK_SIZE * MIC_RX_BLOCK_COUNT,
	     "mic RX storage size mismatch");
/* Processed audio staged between microSD writes (~1 KiB stages). */
static int16_t mic_stage_samples[MIC_STAGE_FRAMES] __aligned(4);
static bool live_stream_failed;
/*
 * Ring saturated during live-only capture: the link fell ~4 s behind. End
 * the utterance with what the link carried instead of failing the cycle —
 * distinct from live_stream_failed, which means the socket itself died.
 */
static bool live_tx_saturated;
/* Defined below with the other capture globals. */
extern volatile bool recording_on_sd;

#ifdef CONFIG_PENDANT_MIC_INJECT
/* G.711 expansion for the debug injection ring (harness builds only). */
static int16_t ulaw_to_linear(uint8_t code)
{
	uint8_t u = (uint8_t)(~code);
	int32_t t = (((u & 0x0F) << 3) + 0x84) << ((u >> 4) & 0x07);

	return (int16_t)((u & 0x80U) ? (0x84 - t) : (t - 0x84));
}
#endif /* CONFIG_PENDANT_MIC_INJECT */

/*
 * Wire-framed Opus packet FIFO in the workspace tail. True SPSC ring: the
 * producer (main: encoder sink) owns head, the consumer (legacy pump on
 * main, or the WS I/O thread in a conversation) owns tail; fill level is
 * derived, never a shared counter. Aligned word stores are atomic on this
 * core, so volatile indices are the whole synchronization story.
 */
static volatile size_t live_fifo_head;
static volatile size_t live_fifo_tail;
static bool live_tx_flush;

static inline uint8_t *live_fifo_storage(void)
{
	return audio_workspace + OPUS_TX_ARENA_BYTES;
}

static inline size_t live_fifo_fill(void)
{
	return (live_fifo_head - live_fifo_tail + OPUS_TX_FIFO_BYTES) %
	       OPUS_TX_FIFO_BYTES;
}

