agenticaiuw/hivemind/firmware/nrf9160/src/main.c
static void button_pressed(const struct device *port,
			   struct gpio_callback *callback,
			   gpio_port_pins_t pins)
{
	ARG_UNUSED(port);
	ARG_UNUSED(callback);
	ARG_UNUSED(pins);
	k_sem_give(&button_press_sem);
}

/*
 * Debug press hook: a debugger (J-Link) can write 1 here to simulate a
 * button press without touching the hardware —
 *   JLinkExe -device nRF9160_xxAA -if SWD -speed 4000 -autoconnect 1
 *   w4 <&pendant_remote_press> 1
 * Polled wherever the firmware waits on the button.
 */
volatile uint32_t pendant_remote_press;

static bool take_remote_press(void)
{
	if (pendant_remote_press == 0U) {
		return false;
	}
	pendant_remote_press = 0U;
	return true;
}

/* ---- Hardware-control ISRs and pollers ---- */

static void memo_button_pressed(const struct device *port,
				struct gpio_callback *callback,
				gpio_port_pins_t pins)
{
	ARG_UNUSED(port);
	ARG_UNUSED(callback);
	ARG_UNUSED(pins);
	k_sem_give(&memo_press_sem);
}

static void approve_button_pressed(const struct device *port,
				   struct gpio_callback *callback,
				   gpio_port_pins_t pins)
{
	ARG_UNUSED(port);
	ARG_UNUSED(callback);
	ARG_UNUSED(pins);
	k_sem_give(&approve_press_sem);
}

static bool take_memo_press(void)
{
	return k_sem_take(&memo_press_sem, K_NO_WAIT) == 0;
}

static void clear_memo_events(void)
{
	while (k_sem_take(&memo_press_sem, K_NO_WAIT) == 0) {
	}
}

static void clear_approve_events(void)
{
	while (k_sem_take(&approve_press_sem, K_NO_WAIT) == 0) {
	}
}

/*
 * Quadrature decode, both edges of both phases, via the standard Gray-code
 * transition table — NOT edge counting. Contact bounce only ever toggles
 * between two ADJACENT states, so a bouncing contact contributes +1 -1 +1
 * -1 ... which sums to nothing; an invalid two-bit jump (electrical noise)
 * scores 0 outright. A mechanical detent is four valid transitions, so the
 * accumulator emits one menu step per ±4 and the half-states a finger
 * resting between detents produces are never heard upstream.
 */
static const int8_t encoder_quad_table[16] = {
	0, -1, 1, 0, 1, 0, 0, -1, -1, 0, 0, 1, 0, 1, -1, 0,
};
static uint8_t encoder_prev_state;
static int8_t encoder_detent_accum;

static uint8_t encoder_read_state(void)
{
	/* Raw levels, not logical: quadrature only cares about transitions,
	 * and the raw read avoids two layered driver calls in an ISR. */
	return (uint8_t)((nrf_gpio_pin_read(encoder_a.pin) << 1) |
			 nrf_gpio_pin_read(encoder_b.pin));
}

static void encoder_edge_isr(const struct device *port,
			     struct gpio_callback *callback,
			     gpio_port_pins_t pins)
{
	ARG_UNUSED(port);
	ARG_UNUSED(callback);
	ARG_UNUSED(pins);

	uint8_t state = encoder_read_state();
	int8_t increment =
		encoder_quad_table[(encoder_prev_state << 2) | state];

	encoder_prev_state = state;
	if (increment == 0) {
		return;
	}
	encoder_detent_accum += increment;
	if (encoder_detent_accum >= 4 || encoder_detent_accum <= -4) {
		int step = encoder_detent_accum > 0 ? 1 : -1;
		atomic_val_t backlog = atomic_get(&menu_step_backlog);

		encoder_detent_accum = 0;
		/* Single ISR producer, so this check-then-add cannot race
		 * itself; the WS thread only ever moves the value toward
		 * zero, which makes the cap conservative, never wrong. */
		if (backlog < MENU_STEP_BACKLOG_MAX &&
		    backlog > -MENU_STEP_BACKLOG_MAX) {
			atomic_add(&menu_step_backlog, step);
		}
	}
}

static void encoder_push_pressed(const struct device *port,
				 struct gpio_callback *callback,
				 gpio_port_pins_t pins)
{
	/* One timestamp is the whole debounce: bounce arrives as a burst of
	 * edges inside a few ms, a human repeat press takes hundreds. */
	static int64_t last_push_ms;
	int64_t now = k_uptime_get();

	ARG_UNUSED(port);
	ARG_UNUSED(callback);
	ARG_UNUSED(pins);
	if (now - last_push_ms < ENCODER_PUSH_DEBOUNCE_MS) {
		return;
	}
	last_push_ms = now;
	atomic_set(&menu_select_req, 1);
}

/*
 * The mic-power sense reads the SPH0645 VDD net through 100k. Logical 0 =
 * the latching switch has the mic dark. A sense pin that never configured
 * reports "not muted": the failure mode of a missing wire must be a
 * working microphone, not a pendant that silently refuses to listen.
 */
static bool mic_power_is_cut(void)
{
	return mic_sense_ready && gpio_pin_get_dt(&mic_sense) == 0;
}

/* ---- Volume knob: SAADC one-shot polling ---- */

#if DT_NODE_HAS_STATUS(DT_NODELABEL(adc), okay)
static const struct device *const volume_adc =
	DEVICE_DT_GET(DT_NODELABEL(adc));
#define VOLUME_ADC_CHANNEL_ID 2

static void volume_adc_init(void)
{
	/*
	 * VDD/4 reference with 1/4 gain makes the conversion ratiometric to
	 * the very rail the pot spans: full scale IS the rail, so a sagging
	 * breadboard supply cancels out of the knob position entirely.
	 * 10 us acquisition covers the wiper's worst-case source impedance
	 * (a 50 k pot at mid-travel is 12.5 k; the SAADC spec allows up to
	 * 40 k at 10 us).
	 */
	static const struct adc_channel_cfg cfg = {
		.gain = ADC_GAIN_1_4,
		.reference = ADC_REF_VDD_1_4,
		.acquisition_time =
			ADC_ACQ_TIME(ADC_ACQ_TIME_MICROSECONDS, 10),
		.channel_id = VOLUME_ADC_CHANNEL_ID,
		.input_positive = NRF_SAADC_AIN2, /* P0.15, the last free AIN */
	};

	if (!device_is_ready(volume_adc) ||
	    adc_channel_setup(volume_adc, &cfg) != 0) {
		printk("Volume knob (P0.15/AIN2) not configured — unity "
		       "gain\n");
		return;
	}
	volume_adc_ready = true;
	printk("Volume knob ready (P0.15/AIN2, ratiometric, ~20 Hz poll)\n");
}

static int volume_adc_read_raw(void)
{
	int16_t sample;
	struct adc_sequence sequence = {
		.channels = BIT(VOLUME_ADC_CHANNEL_ID),
		.buffer = &sample,
		.buffer_size = sizeof(sample),
		.resolution = 12,
		/* 4x hardware oversample: the SAADC's flicker at this gain
		 * is a couple of LSB; burst-averaging in silicon is cheaper
		 * than the ESP32's median-of-five in code. */
		.oversampling = 2U,
	};

	if (adc_read(volume_adc, &sequence) != 0) {
		return -1;
	}
	/* Single-ended reads can dip a hair below zero near GND. */
	return CLAMP((int)sample, 0, VOLUME_RAW_MAX);
}
#else
static void volume_adc_init(void)
{
	printk("Volume knob: no ADC in devicetree — unity gain\n");
}

static int volume_adc_read_raw(void)
{
	return -1;
}
#endif /* adc */

