agenticaiuw/hivemind/firmware/nrf9160/src/main.c
/*
 * ~20 Hz knob poll, callable from any loop that turns often enough (the
 * idle wait at 200 ms and the conversation loop at ~20 ms both call it;
 * the interval gate makes extra calls free).  One blocking one-shot read
 * costs tens of microseconds — noise against the 205 ms TX runway.
 * Hysteresis (>=2 % movement) keeps a resting knob silent; the end-stop
 * snap lets true 0 and true unity be reached, which hysteresis alone
 * would forbid.  The curve is squared (perceived loudness tracks power),
 * identical to the ESP32 implementation this replaces.
 */
static void volume_poll(void)
{
	int64_t now = k_uptime_get();
	int raw;
	uint32_t gain;
	uint32_t hundredths;

	if (!volume_adc_ready || now < volume_next_poll_ms) {
		return;
	}
	volume_next_poll_ms = now + VOLUME_POLL_INTERVAL_MS;

	raw = volume_adc_read_raw();
	if (raw < 0) {
		return;
	}
	if (raw <= VOLUME_SNAP_LOW) {
		raw = 0;
	} else if (raw >= VOLUME_SNAP_HIGH) {
		raw = VOLUME_RAW_MAX;
	}
	if (volume_last_raw >= 0 &&
	    (raw > volume_last_raw ? raw - volume_last_raw
				   : volume_last_raw - raw) <
		    VOLUME_HYSTERESIS_COUNTS &&
	    raw != 0 && raw != VOLUME_RAW_MAX) {
		return;
	}
	if (raw == volume_last_raw) {
		return;
	}
	volume_last_raw = raw;

	/* level = (raw/4095)^2, folded straight into Q12. */
	gain = (uint32_t)(((uint64_t)raw * (uint64_t)raw *
			   VOLUME_GAIN_UNITY_Q12 +
			   ((uint64_t)VOLUME_RAW_MAX * VOLUME_RAW_MAX / 2U)) /
			  ((uint64_t)VOLUME_RAW_MAX * VOLUME_RAW_MAX));
	atomic_set(&volume_gain_q12, (atomic_val_t)gain);

	hundredths = (gain * 100U + VOLUME_GAIN_UNITY_Q12 / 2U) /
		     VOLUME_GAIN_UNITY_Q12;
	atomic_set(&volume_report,
		   (atomic_val_t)((hundredths << 16) | (uint32_t)raw));
	printk("Volume: raw=%d level=%u.%02u\n", raw, hundredths / 100U,
	       hundredths % 100U);
}

/* ---- Wired speaker sink gate ---- */

static const char *audio_sink_name(uint8_t sink)
{
	switch (sink) {
	case AUDIO_SINK_SPEAKER:
		return "speaker";
	case AUDIO_SINK_BOTH:
		return "both";
	default:
		return "bluetooth";
	}
}

/* Safe from any thread: one gpio_pin_set_dt on a pin only this touches. */
static void audio_sink_apply(uint8_t sink)
{
	audio_sink_current = sink;
	if (amp_sd_mode_ready) {
		gpio_pin_set_dt(&amp_sd_mode, sink != AUDIO_SINK_BLUETOOTH);
	}
	printk("Audio sink: %s%s\n", audio_sink_name(sink),
	       amp_sd_mode_ready ? "" : " (amp gate not configured)");
}

/*
 * {"type":"audio_sink","sink":"speaker"|"bluetooth"|"both"} — parsed with
 * the same bounded strstr discipline as the legacy control frames, AFTER
 * the exact-match recipe check for the same reason they are.
 */
static bool audio_sink_offer_frame(const char *frame)
{
	if (strstr(frame, "\"audio_sink\"") == NULL) {
		return false;
	}
	if (strstr(frame, "\"speaker\"") != NULL) {
		audio_sink_apply(AUDIO_SINK_SPEAKER);
	} else if (strstr(frame, "\"both\"") != NULL) {
		audio_sink_apply(AUDIO_SINK_BOTH);
	} else if (strstr(frame, "\"bluetooth\"") != NULL) {
		audio_sink_apply(AUDIO_SINK_BLUETOOTH);
	} else {
		printk("Audio sink frame with unknown sink — kept %s\n",
		       audio_sink_name(audio_sink_current));
	}
	return true;
}

#ifdef CONFIG_PENDANT_OFFLINE_STORE
static void mark_button_pressed(const struct device *port,
				struct gpio_callback *callback,
				gpio_port_pins_t pins)
{
	ARG_UNUSED(port);
	ARG_UNUSED(callback);
	ARG_UNUSED(pins);
	k_sem_give(&mark_press_sem);
}

/*
 * Same shape as pendant_remote_press: plain volatile globals a J-Link writes
 * over SWD, no protocol on the target.
 *
 *   w4 <&pendant_remote_mark> 1     drop a moment bookmark
 *   w4 <&pendant_remote_offline> 1  take the modem OFFLINE (CFUN=4)
 *   w4 <&pendant_remote_offline> 0  bring it back and reattach
 *
 * pendant_remote_offline is how the offline path is proven without shielding
 * the antenna: it is the only way to make "no usable link" a repeatable
 * condition rather than a story about a lift shaft.
 */
volatile uint32_t pendant_remote_mark;
volatile uint32_t pendant_remote_offline;
static bool link_forced_offline;

static bool take_mark_press(void)
{
	if (k_sem_take(&mark_press_sem, K_NO_WAIT) == 0) {
		return true;
	}
	if (pendant_remote_mark != 0U) {
		pendant_remote_mark = 0U;
		return true;
	}
	return false;
}

/*
 * Apply the debug offline request. Closing the WebSocket first matters: the
 * socket is modem-offloaded, so dropping RF underneath it leaves a
 * descriptor that reports connected and fails every send.
 */
static void apply_forced_link_state(void)
{
	bool want_offline = pendant_remote_offline != 0U;

	if (want_offline == link_forced_offline) {
		return;
	}
	if (want_offline) {
		printk("DEBUG: forcing link offline (store-and-forward test)\n");
		k_mutex_lock(&ws_lock, K_FOREVER);
		pendant_ws_close();
		k_mutex_unlock(&ws_lock);
		pendant_cloud_stream_abort();
		/*
		 * Latch BEFORE powering the radio down: pendant_cloud's
		 * ensure_lte_data_ready() resumes a suspended radio in front
		 * of every socket, so suspending alone lasts exactly until
		 * the next press and the capture would come back online
		 * mid-test.
		 */
		pendant_cloud_block_link(true);
		(void)pendant_cloud_suspend_radio();
		link_forced_offline = true;
	} else {
		printk("DEBUG: restoring link\n");
		pendant_cloud_block_link(false);
		(void)pendant_cloud_resume_radio();
		link_forced_offline = false;
	}
}

static bool link_is_forced_offline(void)
{
	return link_forced_offline;
}
#else
static inline void apply_forced_link_state(void) {}
static inline bool link_is_forced_offline(void)
{
	return false;
}
static inline bool take_mark_press(void)
{
	return false;
}
#endif /* CONFIG_PENDANT_OFFLINE_STORE */

/*
 * Button 2 double-press gesture detector (reflex trigger).
 *
 * The single press stays a bookmark, and the header's original argument
 * for button 2 still holds: never make the COMMON action wait for gesture
 * disambiguation.  So the 600 ms second-press window opens ONLY while a
 * gesture recipe is actually armed — with none armed this returns
 * immediately and the bookmark costs exactly what it always cost.  With
 * one armed, the bookmark is delayed by at most the detection window,
 * which is the documented ceiling for this trade.
 *
 * Returns true when a second press landed inside the window (the caller
 * fires the gesture recipes instead of bookmarking).  Edges within the
 * first 100 ms are switch bounce of the SAME press, not a human double —
 * counting them would turn every scratchy contact into a gesture.
 */
#define MARK_GESTURE_WINDOW_MS 600
#define MARK_GESTURE_DEBOUNCE_MS 100

static bool reflex_mark_double_press(void)
{
	int64_t opened_at;

	if (!pendant_reflex_gesture_armed()) {
		return false;
	}
	opened_at = k_uptime_get();
	while (k_uptime_get() - opened_at < MARK_GESTURE_WINDOW_MS) {
		k_msleep(10);
		if (take_mark_press()) {
			if (k_uptime_get() - opened_at <
			    MARK_GESTURE_DEBOUNCE_MS) {
				continue;
			}
			printk("Button 2 double-press gesture (%d ms apart)\n",
			       (int)(k_uptime_get() - opened_at));
			return true;
		}
	}
	return false;
}

