agenticaiuw/hivemind/firmware/nrf9160/src/main.c
#ifdef CONFIG_PENDANT_MIC_INJECT
/*
 * Debug mic injection (harness builds only; see CONFIG_PENDANT_MIC_INJECT).
 *
 * Every end-to-end test used to play speech out of the host's speakers so the
 * physical I2S mic would hear it.  That rig has two variables nobody was
 * holding still — the laptop's distance from the pendant and the host output
 * volume — so any conclusion about capture level was unfalsifiable.  This path
 * replaces the staged mic PCM with bytes the debugger wrote, which makes an
 * utterance reproducible to the sample.
 *
 * Same shape as pendant_remote_press above: plain volatile globals a J-Link
 * writes over SWD, no protocol, no driver on the target.  Layout is a true
 * SPSC ring — the host owns head, this firmware owns tail, fill is derived —
 * so the two sides never need a lock across the debug port.
 *
 *   w4 <&pendant_inject_arm> 1        arm (do this before the press)
 *   <block-write G.711 mu-law bytes into pendant_inject_ring at head>
 *   w4 <&pendant_inject_head> <n>     publish the frames just written
 *   w4 <&pendant_inject_eof> 1        no more PCM coming; stop counting
 *                                     underruns and emit silence
 *
 * A power-of-two frame count lets the index difference be a mask instead of a
 * modulo, and makes the unsigned wrap of (head - tail) exact.
 *
 * WIRE FORMAT IS 8-BIT G.711 mu-LAW, NOT LINEAR PCM, and that is a measured
 * decision.  Every block-write front-end this debug port has was benchmarked
 * against the 31,250 B/s a 16-bit mic stage would consume:
 *
 *   JLinkExe w4 (2 frames/command)         7,960 B/s   3.9x too slow
 *   JLinkExe w8 (4 frames/command)        14,054 B/s   2.2x too slow
 *   JLinkExe loadfile                      resets the MCU — unusable outright
 *   JLinkGDBServer RSP 'X' block write   ~139,000 B/s   on an IDLE target
 *
 * The last number is the trap.  J-Link Commander costs ~0.5 ms per command no
 * matter how small, so only the GDB server's block write is even in range —
 * but its idle throughput is not the throughput available during a call.  The
 * debug port reaches RAM over the AHB-AP, and it contends with a CPU that is
 * running Opus, I2S EasyDMA and the LTE stack.  Traced mid-conversation, the
 * same writes fell to 27-51 kB/s typical with a 114 ms outlier (18 kB/s) — at
 * or below the 31,250 B/s that 16-bit audio needs.  That is a SUSTAINED rate
 * deficit, which no amount of extra buffer can fix; it can only be fixed by
 * sending fewer bytes.
 *
 * mu-law halves the wire rate to 15,625 B/s (~2.2x headroom against the
 * measured in-call median) and simultaneously doubles the runway this fixed
 * 4 KB of RAM buys, because a frame costs one byte instead of two — 262 ms,
 * enough to swallow the 114 ms outliers outright.  The expansion is the same
 * deterministic table the legacy reply path already uses, so an utterance
 * still decodes to identical samples on every run, which is the entire
 * property this rig exists to provide.  The uplink is ~16 kbps Opus SILK-WB,
 * far lossier than G.711, so the quantization costs nothing that survives to
 * the relay.
 */
#define PENDANT_INJECT_RING_FRAMES 4096U
#define PENDANT_INJECT_RING_MASK (PENDANT_INJECT_RING_FRAMES - 1U)
BUILD_ASSERT((PENDANT_INJECT_RING_FRAMES &
	      (PENDANT_INJECT_RING_FRAMES - 1U)) == 0U,
	     "inject ring must be a power of two");
BUILD_ASSERT(PENDANT_INJECT_RING_FRAMES >= 2U * MIC_STAGE_FRAMES,
	     "inject ring must hold at least two stages of runway");

/*
 * 4096 mu-law frames = 4,096 B = 262.14 ms at SAMPLE_RATE 15625, against a
 * 32.77 ms stage period: eight stages of runway, versus a worst observed host
 * stall of 114 ms.  The host keeps the ring topped up rather than draining it
 * to a low-water mark, so the whole 262 ms is available as insurance — see
 * software/ai-pendant-simulator/scripts/inject-audio.mjs.
 *
 * 4,096 B is the size RAM permits, not a size chosen for comfort.  This image
 * had 202,700 of 211,608 B spoken for (95.79%) before the ring existed; the
 * ring plus 24 B of control words takes it to 206,820 B (97.74%), leaving
 * 4,788 B.  Doubling it again would not link.  pendant_inject_underruns is
 * what tells you whether it was enough, which is why it is reported rather
 * than merely counted.
 */
volatile uint8_t pendant_inject_ring[PENDANT_INJECT_RING_FRAMES] __aligned(4);
/* Host writes: 1 = replace mic audio with the ring. */
volatile uint32_t pendant_inject_arm;
/* Host writes: producer index, in frames, free-running mod the ring size. */
volatile uint32_t pendant_inject_head;
/* Firmware writes: consumer index. The host reads it to compute free space. */
volatile uint32_t pendant_inject_tail;
/* Host writes: the utterance is fully queued; a dry ring is no longer a bug. */
volatile uint32_t pendant_inject_eof;
/* Firmware writes: stages that went out short because the host fell behind. */
volatile uint32_t pendant_inject_underruns;
/* Firmware writes: frames actually substituted into the uplink. */
volatile uint32_t pendant_inject_frames;

/*
 * Overwrite one staged mic block with injected PCM. Returns false when
 * injection is not armed, in which case the caller's real mic samples stand.
 */
static bool pendant_inject_fill_stage(int16_t *samples, size_t frame_count)
{
	if (pendant_inject_arm == 0U) {
		return false;
	}

	uint32_t tail = pendant_inject_tail;
	uint32_t fill = (pendant_inject_head - tail) & PENDANT_INJECT_RING_MASK;
	size_t take = MIN((size_t)fill, frame_count);

	for (size_t i = 0U; i < take; ++i) {
		samples[i] = ulaw_to_linear(
			pendant_inject_ring[(tail + i) &
					    PENDANT_INJECT_RING_MASK]);
	}
	/* Samples are consumed before the tail moves, so the host never
	 * overwrites a frame this stage is still reading. */
	compiler_barrier();
	pendant_inject_tail = (tail + (uint32_t)take) &
			      PENDANT_INJECT_RING_MASK;
	pendant_inject_frames += (uint32_t)take;

	if (take < frame_count) {
		/*
		 * Pad with digital silence rather than the live mic. Letting
		 * real audio back in on a starved stage would quietly restore
		 * the acoustic coupling this whole path exists to remove, and
		 * the run would look fine while measuring the wrong thing.
		 */
		memset(&samples[take], 0,
		       (frame_count - take) * sizeof(int16_t));
		if (pendant_inject_eof == 0U) {
			++pendant_inject_underruns;
		}
	}
	return true;
}

