agenticaiuw/hivemind/firmware/nrf9160/src/main.c
/*
 * Injection health rides in the existing "Conversation stats:" line rather
 * than a line of its own: a starved ring produces silence, silence looks
 * exactly like a working run that had nothing to say, and the number that
 * distinguishes them has to be where someone reading the run will see it.
 */
#define PENDANT_INJECT_STATS_FMT \
	" inject_frames=%u inject_underruns=%u"
#define PENDANT_INJECT_STATS_ARGS \
	, pendant_inject_frames, pendant_inject_underruns
#else
static inline bool pendant_inject_fill_stage(int16_t *samples,
					     size_t frame_count)
{
	ARG_UNUSED(samples);
	ARG_UNUSED(frame_count);
	return false;
}
#define PENDANT_INJECT_STATS_FMT ""
#define PENDANT_INJECT_STATS_ARGS
#endif /* CONFIG_PENDANT_MIC_INJECT */

static void clear_button_events(void)
{
	while (k_sem_take(&button_press_sem, K_NO_WAIT) == 0) {
	}
}

static void finish_button_press(void)
{
	/* gpio_pin_get_dt() returns the logical active state. */
	while (gpio_pin_get_dt(&button) > 0) {
		k_msleep(5);
	}
	k_msleep(15);
	clear_button_events();
}

static void flash_led(unsigned int count, int on_ms, int off_ms)
{
	for (unsigned int flash = 0U; flash < count; ++flash) {
		gpio_pin_set_dt(&led, 1);
		k_msleep(on_ms);
		gpio_pin_set_dt(&led, 0);
		k_msleep(off_ms);
	}
}

/*
 * Blue button state machine: press = approve, hold ≥1.5 s = deny. Polled,
 * never blocking, so the same function serves the idle wait (200 ms
 * cadence — a deny lands within ~1.7 s of the hold threshold) and the
 * conversation codec loop (~20 ms cadence, where the approval readback the
 * decision answers is actually playing). A deny fires the moment the hold
 * crosses the threshold rather than at release: the owner holding the
 * button deserves to see the LED answer while their thumb is still down.
 *
 * The decision itself only ever sets an atomic; the WS I/O thread owns the
 * send (ws_io_send_owner_controls), so this can never stall an I2S loop.
 */
static void poll_approval_button(void)
{
	static bool tracking;
	static bool fired_while_held;
	static int64_t pressed_at_ms;
	static int64_t last_decision_ms;
	int64_t now = k_uptime_get();

	if (!tracking) {
		if (k_sem_take(&approve_press_sem, K_NO_WAIT) != 0) {
			return;
		}
		/* Edges inside a beat of the last decision are that press's
		 * release bounce, not a human pressing twice — humans repeat
		 * in hundreds of ms, bounce in ones. */
		if (now - last_decision_ms < 250) {
			clear_approve_events();
			return;
		}
		if (gpio_pin_get_dt(&approve_button) <= 0) {
			/*
			 * Press AND release both fit between two polls (the
			 * idle loop turns at 200 ms). The edge was real — the
			 * ISR only fires on the active edge — and a press
			 * shorter than one poll period cannot have been the
			 * 1.5 s hold, so it is an approve by definition.
			 */
			last_decision_ms = now;
			clear_approve_events();
			if (pendant_ws_connected()) {
				atomic_set(&approval_decision_req, 1);
				printk("Approval button: APPROVE (quick tap)\n");
			} else {
				printk("Approval button: approve dropped "
				       "(converse socket closed)\n");
			}
			if (!atomic_get(&convo_active)) {
				flash_led(1U, 60, 60);
			}
			return;
		}
		tracking = true;
		fired_while_held = false;
		pressed_at_ms = now;
		return;
	}

	if (gpio_pin_get_dt(&approve_button) > 0) {
		if (!fired_while_held &&
		    now - pressed_at_ms >= APPROVE_LONG_PRESS_MS) {
			fired_while_held = true;
			last_decision_ms = now;
			if (pendant_ws_connected()) {
				atomic_set(&approval_decision_req, 2);
				printk("Approval button: DENY (held %d ms)\n",
				       (int)(now - pressed_at_ms));
			} else {
				printk("Approval button: deny dropped "
				       "(converse socket closed)\n");
			}
			if (!atomic_get(&convo_active)) {
				flash_led(2U, 60, 60);
			}
		}
		return;
	}

	/* Released. */
	tracking = false;
	clear_approve_events();
	if (fired_while_held) {
		return; /* the hold already decided */
	}
	if (now - pressed_at_ms < APPROVE_MIN_PRESS_MS) {
		return; /* contact scratch, not a human */
	}
	last_decision_ms = now;
	if (pendant_ws_connected()) {
		atomic_set(&approval_decision_req, 1);
		printk("Approval button: APPROVE (%d ms press)\n",
		       (int)(now - pressed_at_ms));
	} else {
		printk("Approval button: approve dropped "
		       "(converse socket closed)\n");
	}
	if (!atomic_get(&convo_active)) {
		flash_led(1U, 60, 60);
	}
}

/*
 * Solid LED = first speech batch on device (may still be downloading more).
 * Never autoplay — button 1 starts I2S → ESP32 → Bose.
 */
void pendant_notify_reply_first_batch(void)
{
	gpio_pin_set_dt(&led, 1);
	printk("First speech batch ready — solid LED; press button 1 to play "
	       "(no autoplay; download may still be finishing)\n");
}

static int mount_sd_card(void)
{
	int error = -EIO;

	for (unsigned int attempt = 0U; attempt < 5U; ++attempt) {
		error = fs_mount(&sd_mount);
		if (error == 0) {
			break;
		}
		k_msleep(200);
	}
	sd_mount_result = error;
	sd_ready = error == 0;
	return error;
}

static int dump_sd_recording_hex(void)
{
	static const char digits[] = "0123456789abcdef";
	struct fs_file_t file;
	uint8_t bytes[48];
	char line[sizeof(bytes) * 2U + 1U];
	uint32_t total = 0U;
	int error;

	fs_file_t_init(&file);
	error = fs_open(&file, SD_RECORDING_PATH, FS_O_READ);
	if (error != 0) {
		printk("PCM_HEX_ERROR open=%d\n", error);
		return error;
	}

	printk("PCM_HEX_BEGIN\n");
	while (true) {
		ssize_t count = fs_read(&file, bytes, sizeof(bytes));

		if (count < 0) {
			error = (int)count;
			break;
		}
		if (count == 0) {
			error = 0;
			break;
		}

		for (size_t index = 0U; index < (size_t)count; ++index) {
			line[index * 2U] = digits[bytes[index] >> 4];
			line[index * 2U + 1U] = digits[bytes[index] & 0x0fU];
		}
		line[(size_t)count * 2U] = '\0';
		printk("%s\n", line);
		total += (uint32_t)count;
		/*
		 * The 115200-baud DK virtual UART needs about 8.5 ms to carry
		 * one full 48-byte hex line.  Pace this diagnostic stream so
		 * the interface MCU cannot drop bytes while draining printk.
		 */
		k_msleep(12);
	}
	(void)fs_close(&file);
	printk("PCM_HEX_END bytes=%u error=%d\n", total, error);
	return error;
}

struct sd_test_record {
	uint32_t magic;
	uint32_t boot_count;
	uint32_t checksum;
};

static uint32_t sd_test_checksum(const struct sd_test_record *record)
{
	return record->magic ^ record->boot_count ^ SD_TEST_CHECK_XOR;
}

static uint32_t integer_square_root(uint64_t value)
{
	uint64_t result = 0U;
	uint64_t bit = (uint64_t)1U << 62;

	while (bit > value) {
		bit >>= 2;
	}
	while (bit != 0U) {
		if (value >= result + bit) {
			value -= result + bit;
			result = (result >> 1) + bit;
		} else {
			result >>= 1;
		}
		bit >>= 2;
	}
	return (uint32_t)result;
}

static int test_sd_persistence(void)
{
	struct fs_file_t file;
	struct sd_test_record record = { 0 };
	int error;

	sd_persistence_verified = false;
	sd_boot_count = 0U;
	fs_file_t_init(&file);

	error = fs_open(&file, SD_TEST_PATH, FS_O_READ);
	sd_test_read_result = error;
	if (error == 0) {
		ssize_t bytes_read = fs_read(&file, &record, sizeof(record));

		sd_test_read_result = bytes_read == (ssize_t)sizeof(record)
			? 0 : (bytes_read < 0 ? (int)bytes_read : -EIO);
		(void)fs_close(&file);
		if (sd_test_read_result == 0 &&
		    record.magic == SD_TEST_MAGIC &&
		    record.checksum == sd_test_checksum(&record)) {
			sd_persistence_verified = true;
			sd_boot_count = record.boot_count;
		}
	}

	record.magic = SD_TEST_MAGIC;
	record.boot_count = sd_boot_count + 1U;
	record.checksum = sd_test_checksum(&record);

