agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	k_msleep(MIC_POWERUP_BUDGET_MS);
	printk("Conversation: duplex I2S bclk_hz=%u lrclk_hz=%u "
	       "(mic %u Hz up, agent 24 kHz down)\n",
	       16000000U / MIC_BCLK_TOP, 16000000U / MIC_LRCLK_TOP,
	       SAMPLE_RATE);
	error = i2s_trigger(i2s, I2S_DIR_BOTH, I2S_TRIGGER_START);
	if (error != 0) {
		goto teardown_clocks;
	}
	i2s_running = true;
	started_at = k_uptime_get();
	clear_button_events();
	k_msgq_purge(&mic_raw_q);
	atomic_set(&audio_thread_error, 0);
	/* Hand the I2S deadlines to the audio thread from here on. */
	audio_i2s_dev = i2s;
	atomic_set(&convo_active, 1);

	while (true) {
		void *block;
		int64_t loop_started;

		/*
		 * Codec-side loop. The audio thread owns every I2S deadline;
		 * this one may take as long as an Opus frame needs without
		 * endangering the transfer. A missed block here costs mic
		 * audio (counted as mic_drops), never the conversation.
		 */
		if (k_msgq_get(&mic_raw_q, &block, K_MSEC(200)) != 0) {
			if (atomic_get(&convo_end_req) ||
			    !atomic_get(&convo_active)) {
				break;
			}
			continue;
		}
		loop_started = k_uptime_get();
		memcpy(raw_processing, block, MIC_RX_BLOCK_SIZE);
		k_mem_slab_free(&mic_rx_slab, block);

		size_t size = MIC_RX_BLOCK_SIZE;

		if (block_index < MIC_STARTUP_SKIP_BLOCKS) {
			++block_index;
			clear_button_events();
			continue;
		}
		++block_index;

		/* Decide duck/hold for THIS block before any of it is encoded. */
		convo_update_uplink_adapt();

		/* Mic DSP — the twin of record_microphone's inner loop
		 * (slew limit → decimate-average → DC blocker → gain). */
		int32_t *raw = raw_processing;
		size_t out_frames = (size / sizeof(int32_t)) / MIC_DECIMATION;

		for (size_t frame = 0U; frame < out_frames; ++frame) {
			int32_t first = raw[frame * MIC_DECIMATION] >>
					MIC_SAMPLE_SHIFT;
			int32_t second = raw[frame * MIC_DECIMATION + 1U] >>
					 MIC_SAMPLE_SHIFT;

			if (!slew_primed) {
				slew_prev = first;
				slew_primed = true;
			}
			int32_t delta = first - slew_prev;

			delta = CLAMP(delta, -MIC_SLEW_LIMIT, MIC_SLEW_LIMIT);
			slew_prev += delta;
			first = slew_prev;
			delta = second - slew_prev;
			delta = CLAMP(delta, -MIC_SLEW_LIMIT, MIC_SLEW_LIMIT);
			slew_prev += delta;
			second = slew_prev;

			int32_t sample = ((first + second) / 2) >> 8;

			if (!hpf_primed) {
				hpf_prev_in = sample;
				hpf_primed = true;
			}
			int32_t filtered =
				sample - hpf_prev_in +
				(int32_t)(((int64_t)MIC_HPF_COEFF_Q15 *
					   hpf_prev_out) >>
					  15);
			hpf_prev_in = sample;
			hpf_prev_out = filtered;

			int32_t amplified = filtered * MIC_GAIN;

			amplified = CLAMP(amplified, INT16_MIN, INT16_MAX);
			mic_stage_samples[stage_frames] = (int16_t)amplified;
			if (++stage_frames == MIC_STAGE_FRAMES) {
				/* Harness builds only, and only while armed:
				 * swap the mic's stage for injected PCM before
				 * the encoder ever sees it. */
				(void)pendant_inject_fill_stage(
					mic_stage_samples, MIC_STAGE_FRAMES);
				live_tx_offer_stage(mic_stage_samples,
						    MIC_STAGE_FRAMES);
				stage_frames = 0U;
			}
		}
		if (live_stream_failed) {
			result = -EIO;
			break;
		}

		/* The WS thread moves bytes; this loop only decodes. The
		 * audio thread owns playback state and barge-in flushes. */
		convo_decode_downlink();

		/*
		 * Blue button, mid-conversation: this is the moment it exists
		 * for — the relay just read an approval down this very call
		 * and the owner answers with a thumb instead of a phrase.
		 * Poll-only (~µs); the WS thread carries the decision.
		 */
		poll_approval_button();

		if (atomic_get(&convo_end_req)) {
			/* Relay 'end' (mutual silence) or transport close —
			 * a normal conversation ending, not a failure. */
			printk("Conversation ended by relay/transport\n");
			error = 0;
			break;
		}

		/* Solid LED while agent audio is buffered, blink otherwise. */
		if (dl_jitter_fill() > 0U) {
			gpio_pin_set_dt(&led, 1);
			next_led_toggle = k_uptime_get() + 250;
		} else if (k_uptime_get() >= next_led_toggle) {
			gpio_pin_toggle_dt(&led);
			next_led_toggle = k_uptime_get() + 250;
		}

		if (k_uptime_get() - started_at >
		    (int64_t)CONVO_MAX_SECONDS * 1000) {
			printk("Conversation hit the %u s cap\n",
			       CONVO_MAX_SECONDS);
			break;
		}
#if PENDANT_BOOT_CONVERSATION_TEST
		if (k_uptime_get() - started_at >
		    (int64_t)PENDANT_BOOT_CONVERSATION_SECONDS * 1000) {
			printk("Self-test conversation window elapsed\n");
			break;
		}
#endif
		/* Bounce/release edges from the starting press for the first
		 * second; after that a press ends the conversation. */
		if (k_uptime_get() - started_at < 1000) {
			clear_button_events();
		} else if (k_sem_take(&button_press_sem, K_NO_WAIT) == 0 ||
			   take_remote_press()) {
			printk("Conversation ended by button\n");
			break;
		}

		/* Loop time is the whole ballgame: exceed the TX runway and
		 * the driver kills the duplex transfer. Track the worst. */
		uint32_t loop_ms = (uint32_t)(k_uptime_get() - loop_started);

		if (loop_ms > convo_max_loop_ms) {
			convo_max_loop_ms = loop_ms;
		}
	}

	/* Stop the audio thread before touching I2S or the slabs. */
	atomic_set(&convo_active, 0);
	/* Never leave the legacy record path gated by a conversation's hold. */
	convo_uplink_holding = false;
#ifdef CONFIG_PENDANT_MIC_INJECT
	/*
	 * Injection is scoped to one conversation, and disarming here is the
	 * safety net for a host that died mid-run. An armed ring nobody is
	 * feeding does not fail loudly — it silently replaces the microphone
	 * with silence, so the owner's next press would record nothing and
	 * look like broken hardware. Bounding that to the conversation it was
	 * armed for keeps a debug tool from becoming a latent product fault.
	 */
	pendant_inject_arm = 0U;
#endif
	k_msleep(30);
	if (result == 0 && atomic_get(&audio_thread_error) != 0) {
		result = (int)atomic_get(&audio_thread_error);
	}
	{
		void *stale;

		while (k_msgq_get(&mic_raw_q, &stale, K_NO_WAIT) == 0) {
			k_mem_slab_free(&mic_rx_slab, stale);
		}
	}

