agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	printk("Conversation stats: rx_blocks=%u tx_blocks=%u tx_starved=%u "
	       "decoded_packets=%u max_loop_ms=%u fifo_left=%u "
	       "uplink_drops=%u mic_drops=%u tx_peak=%u "
	       "duck_ms=%u uplink_held=%u" PENDANT_INJECT_STATS_FMT
	       PENDANT_STORE_STATS_FMT "\n",
	       convo_rx_blocks, convo_tx_blocks, convo_tx_starved,
	       convo_decoded_packets, convo_max_loop_ms,
	       (uint32_t)live_fifo_fill(), convo_uplink_drops,
	       convo_mic_drops, convo_tx_peak, convo_uplink_duck_ms,
	       convo_uplink_held PENDANT_INJECT_STATS_ARGS
		       PENDANT_STORE_STATS_ARGS);
	printk("Codec cost: decode avg=%u us max=%u us n=%u | "
	       "encode avg=%u us max=%u us n=%u\n",
	       convo_decode_calls
		       ? cycles_to_us(convo_decode_cycles / convo_decode_calls)
		       : 0U,
	       cycles_to_us(convo_decode_max_cycles), convo_decode_calls,
	       convo_encode_calls
		       ? cycles_to_us(convo_encode_cycles / convo_encode_calls)
		       : 0U,
	       cycles_to_us(convo_encode_max_cycles), convo_encode_calls);

teardown_clocks:
	if (i2s_running) {
		/*
		 * DROP, never DRAIN: as a clock-slave, draining needs the PWM
		 * clocks to keep running until every queued TX block plays
		 * out — a 12 ms settle is not enough, and killing the clocks
		 * mid-STOPPING wedges i2s_nrfx (configure then fails -EINVAL
		 * until reboot; review finding). DROP forces READY
		 * synchronously and frees the queued blocks; the ≤41 ms of
		 * tail audio it discards is silence or flushed speech.
		 */
		(void)i2s_trigger(i2s, I2S_DIR_BOTH, I2S_TRIGGER_DROP);
		k_msleep(MIC_STOP_SETTLE_MS);
	}
	mic_clocks_stop();
	gpio_pin_set_dt(&led, 0);
teardown:
	atomic_set(&convo_active, 0);
	/* Whatever happens next, the gate belongs to the NEXT press. */
	atomic_set(&convo_uplink_gate, 0);
	k_mutex_lock(&ws_lock, K_FOREVER);
	/*
	 * Only a conversation the relay was told about needs telling it is
	 * over. A press answered on-device was never announced, so a "stop"
	 * here would be this device's only transmission for that press —
	 * spending the radio to report that it did not need the radio.
	 */
	if (uplink_open && pendant_ws_connected() && !stop_sent) {
		(void)pendant_ws_send_text("{\"type\":\"stop\"}");
		stop_sent = true;
	}
	k_mutex_unlock(&ws_lock);
	pendant_opus_stream_abort();
	pendant_opus_reply_decoder_end();
	clear_button_events();
	/* A green press mid-conversation was not a memo request — it was a
	 * mispress during a call. Consuming it here keeps it from firing a
	 * surprise 30 s capture the moment the call ends. */
	clear_memo_events();
	if (result == 0 && error != 0) {
		result = error;
	}
	return result;
}

/*
 * Green button: record-only memo. The same proven capture machinery as a
 * voice command — record_microphone with the live chunked uplink and the
 * SD journal fallback — with pendant_cloud's memo latch held for the whole
 * cycle, so every request this press can possibly make (live stream, SD
 * single-shot, offline hold) reaches the relay as ?dispatch=0: transcribed
 * and stored, planner never woken. Runs regardless of whether the converse
 * WebSocket is up; a memo never wants the duplex path because a memo wants
 * no reply.
 */
static int run_memo_capture(const struct device *i2s)
{
	int64_t memo_started = k_uptime_get();
	uint32_t pcm_bytes;
	int error;

	pendant_cloud_stream_set_memo(true);
	memo_capture_active = true;
	error = record_microphone(i2s, MAX_RECORD_SAMPLE_COUNT);
	memo_capture_active = false;
	gpio_pin_set_dt(&led, 0);
	if (error != 0) {
		printk("Memo recording failed: %d\n", error);
		pendant_cloud_stream_abort();
		recording_on_sd = false;
		pendant_cloud_stream_set_memo(false);
		flash_led(3U, 120, 120);
		return error;
	}

	pcm_bytes = recorded_samples * (uint32_t)sizeof(int16_t);

	bool live_ok = pendant_cloud_stream_active() && !live_stream_failed &&
		       pendant_cloud_stream_bytes_sent() > 0U;

	error = -EIO;
	if (live_ok) {
		error = pendant_cloud_stream_end();
		printk("LAT memo_stream_end_ms=%lld pcm_bytes=%u result=%d\n",
		       k_uptime_get() - memo_started,
		       pendant_cloud_uploaded_pcm_bytes, error);
	} else if (pendant_cloud_stream_active()) {
		pendant_cloud_stream_abort();
	}

	if (error < 0 && recording_on_sd && pcm_bytes > 0U) {
		printk("Memo fallback SD upload (%u bytes, live_result=%d)\n",
		       pcm_bytes, error);
		error = pendant_cloud_upload_recording(SD_RECORDING_PATH,
						       pcm_bytes, SAMPLE_RATE);
		if (error < 0) {
			/* Same rename-into-the-outbox rescue as a failed
			 * command, under the memo kind so redelivery keeps
			 * the planner off (see pendant_store.h). */
			int queue_error = pendant_store_enqueue_memo(pcm_bytes);

			if (queue_error == 0) {
				printk("Memo held for later delivery "
				       "(upload=%d)\n",
				       error);
				pendant_cloud_stream_set_memo(false);
				flash_led(2U, 60, 90);
				return 0;
			}
			printk("Could not hold memo: %d\n", queue_error);
		}
	}
	pendant_cloud_stream_set_memo(false);

	printk("LAT memo_total_ms=%lld result=%d\n",
	       k_uptime_get() - memo_started, error);
	if (error < 0) {
		flash_led(5U, 100, 100);
		return error;
	}
	/* Two calm flashes: memo landed, nothing is going to talk back. */
	flash_led(2U, 60, 90);
	return 0;
}

/*
 * Configure every 2026-08-12 breadboard control. All best-effort, all
 * logged: the pattern is the bookmark button's ("losing bookmarks is bad;
 * refusing to boot a voice pendant over a spare button is worse"), applied
 * to five more inputs. A control that fails here simply never fires.
 */
static void configure_control_inputs(void)
{
	/* Yellow "ask": a second body for button 1, same ISR, same
	 * semaphore, so every existing press path hears it unchanged. */
	if (gpio_is_ready_dt(&ask_button) &&
	    gpio_pin_configure_dt(&ask_button, GPIO_INPUT) == 0) {
		gpio_init_callback(&ask_button_callback, button_pressed,
				   BIT(ask_button.pin));
		if (gpio_add_callback(ask_button.port, &ask_button_callback) !=
			    0 ||
		    gpio_pin_interrupt_configure_dt(
			    &ask_button, GPIO_INT_EDGE_TO_ACTIVE) != 0) {
			printk("Ask button (P0.21) unavailable\n");
		}
	} else {
		printk("Ask button (P0.21) not configured\n");
	}

	if (gpio_is_ready_dt(&memo_button) &&
	    gpio_pin_configure_dt(&memo_button, GPIO_INPUT) == 0) {
		gpio_init_callback(&memo_button_callback, memo_button_pressed,
				   BIT(memo_button.pin));
		if (gpio_add_callback(memo_button.port,
				      &memo_button_callback) != 0 ||
		    gpio_pin_interrupt_configure_dt(
			    &memo_button, GPIO_INT_EDGE_TO_ACTIVE) != 0) {
			printk("Memo button (P0.22) unavailable\n");
		}
	} else {
		printk("Memo button (P0.22) not configured\n");
	}

	if (gpio_is_ready_dt(&approve_button) &&
	    gpio_pin_configure_dt(&approve_button, GPIO_INPUT) == 0) {
		gpio_init_callback(&approve_button_callback,
				   approve_button_pressed,
				   BIT(approve_button.pin));
		if (gpio_add_callback(approve_button.port,
				      &approve_button_callback) != 0 ||
		    gpio_pin_interrupt_configure_dt(
			    &approve_button, GPIO_INT_EDGE_TO_ACTIVE) != 0) {
			printk("Approve button (P0.23) unavailable\n");
		}
	} else {
		printk("Approve button (P0.23) not configured\n");
	}

	/* Encoder: both phases in ONE callback (same port), both edges —
	 * the quadrature table needs every transition, not just presses. */
	if (gpio_is_ready_dt(&encoder_a) && gpio_is_ready_dt(&encoder_b) &&
	    gpio_pin_configure_dt(&encoder_a, GPIO_INPUT) == 0 &&
	    gpio_pin_configure_dt(&encoder_b, GPIO_INPUT) == 0) {
		encoder_prev_state = encoder_read_state();
		gpio_init_callback(&encoder_callback, encoder_edge_isr,
				   BIT(encoder_a.pin) | BIT(encoder_b.pin));
		if (gpio_add_callback(encoder_a.port, &encoder_callback) !=
			    0 ||
		    gpio_pin_interrupt_configure_dt(&encoder_a,
						    GPIO_INT_EDGE_BOTH) != 0 ||
		    gpio_pin_interrupt_configure_dt(&encoder_b,
						    GPIO_INT_EDGE_BOTH) != 0) {
			printk("Encoder (P0.24/25) unavailable\n");
		}
	} else {
		printk("Encoder (P0.24/25) not configured\n");
	}

	if (gpio_is_ready_dt(&encoder_push) &&
	    gpio_pin_configure_dt(&encoder_push, GPIO_INPUT) == 0) {
		gpio_init_callback(&encoder_push_callback,
				   encoder_push_pressed,
				   BIT(encoder_push.pin));
		if (gpio_add_callback(encoder_push.port,
				      &encoder_push_callback) != 0 ||
		    gpio_pin_interrupt_configure_dt(
			    &encoder_push, GPIO_INT_EDGE_TO_ACTIVE) != 0) {
			printk("Encoder push (P0.28) unavailable\n");
		}
	} else {
		printk("Encoder push (P0.28) not configured\n");
	}

	/* Mic-power sense: polled, no interrupt, and NO PULL — it watches
	 * the mic VDD net through 100k and must not bias it. */
	if (gpio_is_ready_dt(&mic_sense) &&
	    gpio_pin_configure_dt(&mic_sense, GPIO_INPUT) == 0) {
		mic_sense_ready = true;
		printk("Mic power sense ready (P0.26): mic is %s\n",
		       mic_power_is_cut() ? "MUTED (power cut)" : "powered");
	} else {
		printk("Mic power sense (P0.26) not configured — assuming "
		       "mic powered\n");
	}
}

