agenticaiuw/hivemind/firmware/nrf9160/src/main.c
/*
 * The owner hard-muted the mic and pressed a capture button anyway. Say so
 * on every channel this device has: the control frame lets the relay (and
 * eventually the agent) know the press happened and why nothing follows,
 * and the LED pattern answers the thumb directly — three fast double-taps,
 * used nowhere else. Capture is suppressed entirely: recording a powered-
 * down mic would upload thirty seconds of pulldown silence as if the owner
 * had spoken.
 */
static void report_mic_muted_press(void)
{
	printk("Capture press ignored: mic power is cut (red switch)\n");
	if (pendant_ws_connected()) {
		k_mutex_lock(&ws_lock, K_FOREVER);
		(void)pendant_ws_send_text("{\"type\":\"mic_muted\"}");
		k_mutex_unlock(&ws_lock);
	}
	for (unsigned int burst = 0U; burst < 3U; ++burst) {
		flash_led(2U, 40, 40);
		k_msleep(120);
	}
}

int main(void)
{
	const struct device *const i2s = DEVICE_DT_GET(I2S_NODE);
	int error;

	if (!gpio_is_ready_dt(&led)) {
		audio_cycle_result = -ENODEV;
		return 0;
	}
	error = gpio_pin_configure_dt(&led, GPIO_OUTPUT_INACTIVE);
	if (error != 0) {
		audio_cycle_result = error;
		return 0;
	}
	if (!gpio_is_ready_dt(&button)) {
		audio_cycle_result = -ENODEV;
		show_error();
	}
	error = gpio_pin_configure_dt(&button, GPIO_INPUT);
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
	gpio_init_callback(&button_callback, button_pressed, BIT(button.pin));
	error = gpio_add_callback(button.port, &button_callback);
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
	error = gpio_pin_interrupt_configure_dt(&button, GPIO_INT_EDGE_TO_ACTIVE);
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
#ifdef CONFIG_PENDANT_OFFLINE_STORE
	/*
	 * Button 2 is a convenience, not a dependency: if it fails to
	 * configure, log it and keep going. Losing bookmarks is bad; refusing
	 * to boot a voice pendant over a spare button is worse.
	 */
	if (gpio_is_ready_dt(&mark_button) &&
	    gpio_pin_configure_dt(&mark_button, GPIO_INPUT) == 0) {
		gpio_init_callback(&mark_button_callback, mark_button_pressed,
				   BIT(mark_button.pin));
		if (gpio_add_callback(mark_button.port,
				      &mark_button_callback) != 0 ||
		    gpio_pin_interrupt_configure_dt(
			    &mark_button, GPIO_INT_EDGE_TO_ACTIVE) != 0) {
			printk("Bookmark button unavailable — use "
			       "pendant_remote_mark\n");
		}
	} else {
		printk("Bookmark button not present on this board\n");
	}
#endif
	configure_control_inputs();
	if (!device_is_ready(i2s)) {
		audio_cycle_result = -ENODEV;
		show_error();
	}

	if (mount_sd_card() == 0 && test_sd_persistence() != 0) {
		sd_ready = false;
	}
	if (!sd_ready) {
		printk("microSD is required for Internet voice upload\n");
		audio_cycle_result = sd_mount_result;
		show_error();
	}

	/*
	 * Before LTE, deliberately: the queue must come back from the card
	 * whether or not this boot ever gets signal. A recovery path that
	 * depends on the network is not a recovery path.
	 */
	pendant_store_init();

	/*
	 * Reflex layer, also before LTE for the same reason: a timer or a
	 * daily nudge that only exists once the network is up is not a
	 * reflex.  Haptic first — its single boot probe decides whether
	 * every haptic action runs the motor or degrades to LED.
	 */
	(void)haptic_init();
	pendant_reflex_init(&reflex_ops_impl);

#if PENDANT_BOOT_DUMP_PCM_HEX
	if (sd_ready) {
		(void)dump_sd_recording_hex();
	}
#endif

	/* Boot card check: two slow flashes means the required SD card mounted. */
	for (unsigned int flash = 0U; flash < 2U; ++flash) {
		gpio_pin_set_dt(&led, 1);
		k_msleep(160);
		gpio_pin_set_dt(&led, 0);
		k_msleep(160);
	}

#if PENDANT_BOOT_AUTORECORD_TEST
	clear_button_events();
	printk("BOOT_MIC_AUTOTEST_BEGIN\n");
	error = record_microphone(i2s, AUTORECORD_TEST_SAMPLE_COUNT);
	gpio_pin_set_dt(&led, 0);
	printk("BOOT_MIC_AUTOTEST_END result=%d samples=%u\n",
	       error, recorded_samples);
	report_main_stack_headroom("capture");
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
#endif

#if PENDANT_BOOT_ENCODE_SELFTEST
	/* Runs before LTE so a network problem cannot mask a codec fault. */
	if (encode_stack_selftest() != 0) {
		printk("Encode stack selftest failed\n");
	}
#endif

	/*
	 * Solid LED while LTE attaches (up to CONFIG_LTE_NETWORK_TIMEOUT).
	 * Off after success = ready for Button 1 (recording blinks ~250 ms).
	 * Rapid 100 ms blink = show_error() after attach failure.
	 */
	printk("LTE init begin (LED solid = attaching; live Opus enabled)\n");
	gpio_pin_set_dt(&led, 1);
	error = pendant_cloud_init();
	gpio_pin_set_dt(&led, 0);
	if (error != 0) {
		printk("LTE initialization failed: %d\n", error);
		audio_cycle_result = error;
		show_error();
	}
	printk("LTE OK — ready for button (press = record + live upload)\n");

	/* Socket I/O lives on its own thread from here on: audio deadlines
	 * on main can never be blocked by a stalled modem send. */
	k_thread_create(&ws_io_thread_data, ws_io_stack,
			K_THREAD_STACK_SIZEOF(ws_io_stack), ws_io_thread_fn,
			NULL, NULL, NULL, WS_IO_PRIORITY, 0, K_NO_WAIT);
	k_thread_name_set(&ws_io_thread_data, "ws_io");

	/* And the I2S deadlines live on a cooperative thread that does
	 * nothing but move buffers — codecs can never delay it. */
	audio_i2s_dev = i2s;
	k_thread_create(&audio_thread_data, audio_thread_stack,
			K_THREAD_STACK_SIZEOF(audio_thread_stack),
			audio_thread_fn, NULL, NULL, NULL,
			AUDIO_THREAD_PRIORITY, 0, K_NO_WAIT);
	k_thread_name_set(&audio_thread_data, "audio");

	if (CONFIG_PENDANT_BOOT_AGENT_JOB_ID[0] != '\0') {
		printk("BOOT_AGENT_REPLY_TEST_BEGIN job=%s\n",
		       CONFIG_PENDANT_BOOT_AGENT_JOB_ID);
		error = pendant_cloud_set_job_id_for_diagnostic(
			CONFIG_PENDANT_BOOT_AGENT_JOB_ID);
		if (error == 0) {
			error = pendant_cloud_wait_for_agent_reply(
				PENDANT_CLOUD_REPLY_AUDIO_PATH);
		}
		if (error == 0 &&
		    pendant_cloud_reply_format ==
			    PENDANT_CLOUD_AUDIO_OGG_OPUS) {
			struct pendant_opus_stats decode_stats;

			error = pendant_opus_decode_file(
				PENDANT_CLOUD_REPLY_AUDIO_PATH,
				PENDANT_CLOUD_REPLY_PCM_PATH,
				audio_workspace, sizeof(audio_workspace),
				&decode_stats);
		}
		printk("BOOT_AGENT_REPLY_TEST_END result=%d HTTP=%d "
		       "PCM bytes=%u\n",
		       error, pendant_cloud_last_http_status,
		       pendant_cloud_reply_pcm_bytes);
	}

#if PENDANT_BOOT_UPLOAD_EXISTING
	printk("Boot diagnostic: uploading existing SD PCM recording\n");
	gpio_pin_set_dt(&led, 1);
	int64_t lat_cycle_started = k_uptime_get();
	struct fs_dirent boot_entry;

