agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	error = fs_stat(SD_RECORDING_PATH, &boot_entry);
	if (error == 0 && boot_entry.type == FS_DIR_ENTRY_FILE &&
	    boot_entry.size > 0U) {
		error = pendant_cloud_upload_recording(
			SD_RECORDING_PATH, (uint32_t)boot_entry.size,
			SAMPLE_RATE);
	} else if (error == 0) {
		error = -ENODATA;
	}
	printk("LAT cycle_to_dispatch_ms=%lld\n",
	       k_uptime_get() - lat_cycle_started);
	gpio_pin_set_dt(&led, 0);
	printk("Boot upload result: %d (transcribe=%d dispatch=%d HTTP=%d "
	       "PCM bytes=%u)\n",
	       error, pendant_cloud_transcribe_result,
	       pendant_cloud_dispatch_result,
	       pendant_cloud_last_http_status,
	       pendant_cloud_uploaded_pcm_bytes);
	report_main_stack_headroom("boot upload");
	audio_cycle_result = error;
#endif

	clear_button_events();

#if PENDANT_BOOT_AUDIO_CYCLE_TEST
	bool boot_audio_cycle_test_pending = true;
#endif
#if PENDANT_BOOT_CONVERSATION_TEST
	bool boot_conversation_test_pending = true;
#endif

	while (true) {
		/*
		 * Ready: hold ONE WebSocket open (pings keep Cloudflare's
		 * 100 s idle killer away) instead of rebuilding TLS every
		 * 15 s like the chunked-HTTP prewarm had to.
		 */
		audio_cycle_phase = 0U;
		gpio_pin_set_dt(&led, 0);
		apply_forced_link_state();
		if (!pendant_ws_connected() && !link_is_forced_offline()) {
			int ws_error;

			k_mutex_lock(&ws_lock, K_FOREVER);
			ws_error = pendant_ws_connect();
			k_mutex_unlock(&ws_lock);
			if (ws_error != 0) {
				printk("Idle WS connect failed: %d "
				       "(legacy HTTP path on next press)\n",
				       ws_error);
			}
		}

#if PENDANT_BOOT_AUDIO_CYCLE_TEST
		if (boot_audio_cycle_test_pending) {
			boot_audio_cycle_test_pending = false;
			k_msleep(1500);
			k_sem_give(&button_press_sem);
		}
#endif
#if PENDANT_BOOT_CONVERSATION_TEST
		if (boot_conversation_test_pending) {
			boot_conversation_test_pending = false;
			printk("SELFTEST_CONVERSATION_BEGIN window=%u s\n",
			       PENDANT_BOOT_CONVERSATION_SECONDS);
			k_msleep(1500);
			k_sem_give(&button_press_sem);
		}
#endif
		/* Wait for a press. The WS I/O thread keeps the idle socket
		 * alive (pings + stray drains); main only reconnects. */
		bool marked = false;
		bool memo_requested = false;

		while (k_sem_take(&button_press_sem, K_MSEC(200)) != 0) {
			if (take_remote_press()) {
				break;
			}
			/* Green button: record-only memo, no planner. */
			if (take_memo_press()) {
				memo_requested = true;
				break;
			}
			/* Blue button: approve/deny the pending approval. */
			poll_approval_button();
			/*
			 * Button 2 needs no radio, no microphone and no
			 * decision about whether the link is usable. It is
			 * the one thing this device can always do.
			 *
			 * A double-press inside 600 ms is the reflex
			 * gesture; the window only opens while a gesture
			 * recipe is armed (see reflex_mark_double_press),
			 * so the plain bookmark path is undelayed until
			 * the owner installs one.
			 */
			if (take_mark_press()) {
				if (reflex_mark_double_press()) {
					pendant_reflex_fire_gesture();
					continue;
				}
				marked = true;
				break;
			}
			/*
			 * Reflex work rides the idle wait, the one context
			 * where I2S, the codec scratch and the SD card are
			 * all guaranteed unowned: store a pending downlink
			 * recipe (+ack upstream), then fire whatever came
			 * due.  Recipes received mid-conversation sit in
			 * their one-slot buffer until the conversation
			 * ends and this loop runs again.
			 */
			{
				char reflex_ack[96];

				if (pendant_reflex_process_pending(
					    reflex_ack,
					    sizeof(reflex_ack)) > 0 &&
				    pendant_ws_connected()) {
					k_mutex_lock(&ws_lock, K_FOREVER);
					(void)pendant_ws_send_text(
						reflex_ack);
					k_mutex_unlock(&ws_lock);
				}
			}
			pendant_reflex_tick();
			apply_forced_link_state();
			if (!pendant_ws_connected() &&
			    !link_is_forced_offline()) {
				int ws_error;

				k_mutex_lock(&ws_lock, K_FOREVER);
				ws_error = pendant_ws_connect();
				k_mutex_unlock(&ws_lock);
				if (ws_error != 0) {
					printk("Idle WS reconnect failed: %d\n",
					       ws_error);
				}
			}

			/*
			 * Drain the backlog HERE, inside the wait, not at the
			 * top of the outer loop: the outer loop only turns
			 * over when a press ends, so a device sitting idle
			 * after a dead zone would hold yesterday's memos
			 * until the owner happened to press the button —
			 * exactly the person the queue exists to spare.
			 *
			 * A live WebSocket is the only honest proof this
			 * device has that the link works (the modem reports
			 * an attached network while every relay socket times
			 * out), so delivery is gated on that and never on a
			 * timer or on optimism. One item per pass, skipped
			 * entirely while a press is pending: a held 30 s memo
			 * takes seconds to upload and the owner must never
			 * wait behind it.
			 */
			if (pendant_ws_connected()) {
				pendant_store_poll_alerts();
				if (pendant_store_pending() > 0U &&
				    k_sem_count_get(&button_press_sem) == 0U &&
				    pendant_remote_press == 0U) {
					(void)pendant_store_drain_one(
						SAMPLE_RATE);
				}
			}
		}
		/* Latency-first: act on the active edge, never the release. */
		clear_button_events();

		if (marked) {
			(void)pendant_store_enqueue_mark(
				pendant_ws_connected());
			/* One short flash: marked, nothing else happened. */
			flash_led(1U, 60, 120);
			continue;
		}

		/*
		 * Every capture path defers to the red latching switch: with
		 * mic power cut there is nothing to record, only a pulldown
		 * hum to upload, so the press becomes a notification instead
		 * of a capture. Checked before the WS/legacy split because
		 * it outranks both.
		 */
		if (mic_power_is_cut()) {
			report_mic_muted_press();
			clear_memo_events();
			clear_button_events();
			continue;
		}

		if (memo_requested) {
			audio_cycle_phase = 1U;
			(void)run_memo_capture(i2s);
			clear_memo_events();
			clear_button_events();
			continue;
		}

		/*
		 * The owner is here. This is the moment the alert inbox
		 * exists for, and it deliberately runs BEFORE any decision
		 * about the link: reading held alerts is a card read and a
		 * printk, so it works identically with the radio powered off.
		 */
		if (pendant_store_inbox_pending() > 0U) {
			flash_led(2U, 60, 90);
			pendant_store_surface_inbox();
		}

